dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f217_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32F217_gpio_v1_0_Modes.xml*/

#if !defined(_STM32F217_PINMUX_H_)
# define _STM32F217_PINMUX_H_

#define CAN1_RX_FUNC             0
#define CAN1_TX_FUNC             1
#define CAN2_RX_FUNC             2
#define CAN2_TX_FUNC             3
#define DCMI_D0_FUNC             4
#define DCMI_D1_FUNC             5
#define DCMI_D10_FUNC            6
#define DCMI_D11_FUNC            7
#define DCMI_D12_FUNC            8
#define DCMI_D13_FUNC            9
#define DCMI_D2_FUNC             10
#define DCMI_D3_FUNC             11
#define DCMI_D4_FUNC             12
#define DCMI_D5_FUNC             13
#define DCMI_D6_FUNC             14
#define DCMI_D7_FUNC             15
#define DCMI_D8_FUNC             16
#define DCMI_D9_FUNC             17
#define DCMI_HSYNC_FUNC          18
#define DCMI_PIXCK_FUNC          19
#define DCMI_VSYNC_FUNC          20
#define ETH_COL_FUNC             21
#define ETH_CRS_FUNC             22
#define ETH_CRS_DV_FUNC          23
#define ETH_MDC_FUNC             24
#define ETH_MDIO_FUNC            25
#define ETH_PPS_OUT_FUNC         26
#define ETH_REF_CLK_FUNC         27
#define ETH_RXD0_FUNC            28
#define ETH_RXD1_FUNC            29
#define ETH_RXD2_FUNC            30
#define ETH_RXD3_FUNC            31
#define ETH_RX_CLK_FUNC          32
#define ETH_RX_DV_FUNC           33
#define ETH_RX_ER_FUNC           34
#define ETH_TXD0_FUNC            35
#define ETH_TXD1_FUNC            36
#define ETH_TXD2_FUNC            37
#define ETH_TXD3_FUNC            38
#define ETH_TX_CLK_FUNC          39
#define ETH_TX_EN_FUNC           40
#define FSMC_A0_FUNC             41
#define FSMC_A1_FUNC             42
#define FSMC_A10_FUNC            43
#define FSMC_A11_FUNC            44
#define FSMC_A12_FUNC            45
#define FSMC_A13_FUNC            46
#define FSMC_A14_FUNC            47
#define FSMC_A15_FUNC            48
#define FSMC_A16_FUNC            49
#define FSMC_A17_FUNC            50
#define FSMC_A18_FUNC            51
#define FSMC_A19_FUNC            52
#define FSMC_A2_FUNC             53
#define FSMC_A20_FUNC            54
#define FSMC_A21_FUNC            55
#define FSMC_A22_FUNC            56
#define FSMC_A23_FUNC            57
#define FSMC_A24_FUNC            58
#define FSMC_A25_FUNC            59
#define FSMC_A3_FUNC             60
#define FSMC_A4_FUNC             61
#define FSMC_A5_FUNC             62
#define FSMC_A6_FUNC             63
#define FSMC_A7_FUNC             64
#define FSMC_A8_FUNC             65
#define FSMC_A9_FUNC             66
#define FSMC_ALE_FUNC            67
#define FSMC_CD_FUNC             68
#define FSMC_CLE_FUNC            69
#define FSMC_CLK_FUNC            70
#define FSMC_D0_FUNC             71
#define FSMC_D1_FUNC             72
#define FSMC_D10_FUNC            73
#define FSMC_D11_FUNC            74
#define FSMC_D12_FUNC            75
#define FSMC_D13_FUNC            76
#define FSMC_D14_FUNC            77
#define FSMC_D15_FUNC            78
#define FSMC_D2_FUNC             79
#define FSMC_D3_FUNC             80
#define FSMC_D4_FUNC             81
#define FSMC_D5_FUNC             82
#define FSMC_D6_FUNC             83
#define FSMC_D7_FUNC             84
#define FSMC_D8_FUNC             85
#define FSMC_D9_FUNC             86
#define FSMC_DA0_FUNC            87
#define FSMC_DA1_FUNC            88
#define FSMC_DA10_FUNC           89
#define FSMC_DA11_FUNC           90
#define FSMC_DA12_FUNC           91
#define FSMC_DA13_FUNC           92
#define FSMC_DA14_FUNC           93
#define FSMC_DA15_FUNC           94
#define FSMC_DA2_FUNC            95
#define FSMC_DA3_FUNC            96
#define FSMC_DA4_FUNC            97
#define FSMC_DA5_FUNC            98
#define FSMC_DA6_FUNC            99
#define FSMC_DA7_FUNC            100
#define FSMC_DA8_FUNC            101
#define FSMC_DA9_FUNC            102
#define FSMC_INT2_FUNC           103
#define FSMC_INT3_FUNC           104
#define FSMC_INTR_FUNC           105
#define FSMC_NBL0_FUNC           106
#define FSMC_NBL1_FUNC           107
#define FSMC_NCE2_FUNC           108
#define FSMC_NCE3_FUNC           109
#define FSMC_NCE4_1_FUNC         110
#define FSMC_NCE4_2_FUNC         111
#define FSMC_NE1_FUNC            112
#define FSMC_NE2_FUNC            113
#define FSMC_NE3_FUNC            114
#define FSMC_NE4_FUNC            115
#define FSMC_NIORD_FUNC          116
#define FSMC_NIOWR_FUNC          117
#define FSMC_NL_FUNC             118
#define FSMC_NOE_FUNC            119
#define FSMC_NREG_FUNC           120
#define FSMC_NWAIT_FUNC          121
#define FSMC_NWE_FUNC            122
#define I2C1_SCL_FUNC            123
#define I2C1_SDA_FUNC            124
#define I2C1_SMBA_FUNC           125
#define I2C2_SCL_FUNC            126
#define I2C2_SDA_FUNC            127
#define I2C2_SMBA_FUNC           128
#define I2C3_SCL_FUNC            129
#define I2C3_SDA_FUNC            130
#define I2C3_SMBA_FUNC           131
#define I2S2_MCK_FUNC            132
#define I2S2_SCK_FUNC            133
#define I2S2_SD_FUNC             134
#define I2S2_WS_FUNC             135
#define I2S3_MCK_FUNC            136
#define I2S3_SCK_FUNC            137
#define I2S3_SD_FUNC             138
#define I2S3_WS_FUNC             139
#define I2S_CKIN_FUNC            140
#define RCC_MCO_1_FUNC           141
#define RCC_MCO_2_FUNC           142
#define RCC_OSC32_IN_FUNC        143
#define RCC_OSC32_OUT_FUNC       144
#define RCC_OSC_IN_FUNC          145
#define RCC_OSC_OUT_FUNC         146
#define RTC_AF1_FUNC             147
#define RTC_AF2_FUNC             148
#define RTC_REFIN_FUNC           149
#define SDIO_CK_FUNC             150
#define SDIO_CMD_FUNC            151
#define SDIO_D0_FUNC             152
#define SDIO_D1_FUNC             153
#define SDIO_D2_FUNC             154
#define SDIO_D3_FUNC             155
#define SDIO_D4_FUNC             156
#define SDIO_D5_FUNC             157
#define SDIO_D6_FUNC             158
#define SDIO_D7_FUNC             159
#define SPI1_MISO_FUNC           160
#define SPI1_MOSI_FUNC           161
#define SPI1_NSS_FUNC            162
#define SPI1_SCK_FUNC            163
#define SPI2_MISO_FUNC           164
#define SPI2_MOSI_FUNC           165
#define SPI2_NSS_FUNC            166
#define SPI2_SCK_FUNC            167
#define SPI3_MISO_FUNC           168
#define SPI3_MOSI_FUNC           169
#define SPI3_NSS_FUNC            170
#define SPI3_SCK_FUNC            171
#define SYS_JTCK_SWCLK_FUNC      172
#define SYS_JTDI_FUNC            173
#define SYS_JTDO_SWO_FUNC        174
#define SYS_JTMS_SWDIO_FUNC      175
#define SYS_JTRST_FUNC           176
#define SYS_TRACECLK_FUNC        177
#define SYS_TRACED0_FUNC         178
#define SYS_TRACED1_FUNC         179
#define SYS_TRACED2_FUNC         180
#define SYS_TRACED3_FUNC         181
#define SYS_WKUP_FUNC            182
#define TIM10_CH1_FUNC           183
#define TIM11_CH1_FUNC           184
#define TIM12_CH1_FUNC           185
#define TIM12_CH2_FUNC           186
#define TIM13_CH1_FUNC           187
#define TIM14_CH1_FUNC           188
#define TIM1_BKIN_FUNC           189
#define TIM1_CH1_FUNC            190
#define TIM1_CH1N_FUNC           191
#define TIM1_CH2_FUNC            192
#define TIM1_CH2N_FUNC           193
#define TIM1_CH3_FUNC            194
#define TIM1_CH3N_FUNC           195
#define TIM1_CH4_FUNC            196
#define TIM1_ETR_FUNC            197
#define TIM2_CH1_FUNC            198
#define TIM2_CH2_FUNC            199
#define TIM2_CH3_FUNC            200
#define TIM2_CH4_FUNC            201
#define TIM2_ETR_FUNC            202
#define TIM3_CH1_FUNC            203
#define TIM3_CH2_FUNC            204
#define TIM3_CH3_FUNC            205
#define TIM3_CH4_FUNC            206
#define TIM3_ETR_FUNC            207
#define TIM4_CH1_FUNC            208
#define TIM4_CH2_FUNC            209
#define TIM4_CH3_FUNC            210
#define TIM4_CH4_FUNC            211
#define TIM4_ETR_FUNC            212
#define TIM5_CH1_FUNC            213
#define TIM5_CH2_FUNC            214
#define TIM5_CH3_FUNC            215
#define TIM5_CH4_FUNC            216
#define TIM8_BKIN_FUNC           217
#define TIM8_CH1_FUNC            218
#define TIM8_CH1N_FUNC           219
#define TIM8_CH2_FUNC            220
#define TIM8_CH2N_FUNC           221
#define TIM8_CH3_FUNC            222
#define TIM8_CH3N_FUNC           223
#define TIM8_CH4_FUNC            224
#define TIM8_ETR_FUNC            225
#define TIM9_CH1_FUNC            226
#define TIM9_CH2_FUNC            227
#define UART4_RX_FUNC            228
#define UART4_TX_FUNC            229
#define UART5_RX_FUNC            230
#define UART5_TX_FUNC            231
#define USART1_CK_FUNC           232
#define UART1_CK_FUNC            232
#define USART1_CTS_FUNC          233
#define UART1_CTS_FUNC           233
#define USART1_RTS_FUNC          234
#define UART1_RTS_FUNC           234
#define USART1_RX_FUNC           235
#define UART1_RX_FUNC            235
#define USART1_TX_FUNC           236
#define UART1_TX_FUNC            236
#define USART2_CK_FUNC           237
#define UART2_CK_FUNC            237
#define USART2_CTS_FUNC          238
#define UART2_CTS_FUNC           238
#define USART2_RTS_FUNC          239
#define UART2_RTS_FUNC           239
#define USART2_RX_FUNC           240
#define UART2_RX_FUNC            240
#define USART2_TX_FUNC           241
#define UART2_TX_FUNC            241
#define USART3_CK_FUNC           242
#define UART3_CK_FUNC            242
#define USART3_CTS_FUNC          243
#define UART3_CTS_FUNC           243
#define USART3_RTS_FUNC          244
#define UART3_RTS_FUNC           244
#define USART3_RX_FUNC           245
#define UART3_RX_FUNC            245
#define USART3_TX_FUNC           246
#define UART3_TX_FUNC            246
#define USART6_CK_FUNC           247
#define UART6_CK_FUNC            247
#define USART6_CTS_FUNC          248
#define UART6_CTS_FUNC           248
#define USART6_RTS_FUNC          249
#define UART6_RTS_FUNC           249
#define USART6_RX_FUNC           250
#define UART6_RX_FUNC            250
#define USART6_TX_FUNC           251
#define UART6_TX_FUNC            251
#define USB_OTG_FS_DM_FUNC       252
#define USB_OTG_FS_DP_FUNC       253
#define USB_OTG_FS_ID_FUNC       254
#define USB_OTG_FS_SOF_FUNC      255
#define USB_OTG_HS_DM_FUNC       256
#define USB_OTG_HS_DP_FUNC       257
#define USB_OTG_HS_ID_FUNC       258
#define USB_OTG_HS_SOF_FUNC      259
#define USB_OTG_HS_ULPI_CK_FUNC  260
#define USB_OTG_HS_ULPI_D0_FUNC  261
#define USB_OTG_HS_ULPI_D1_FUNC  262
#define USB_OTG_HS_ULPI_D2_FUNC  263
#define USB_OTG_HS_ULPI_D3_FUNC  264
#define USB_OTG_HS_ULPI_D4_FUNC  265
#define USB_OTG_HS_ULPI_D5_FUNC  266
#define USB_OTG_HS_ULPI_D6_FUNC  267
#define USB_OTG_HS_ULPI_D7_FUNC  268
#define USB_OTG_HS_ULPI_DIR_FUNC 269
#define USB_OTG_HS_ULPI_NXT_FUNC 270
#define USB_OTG_HS_ULPI_STP_FUNC 271
#define USB_OTG_HS_VBUS_FUNC     272

